##SuiteCRM 7.7.3

Дамп базы в suite_dump.sql

Работа с веб сервисами soap и rest (2 задания) - https://github.com/Calm12/soaprest

***
Делал практически все напрямую, без custom, это вроде не критично в данной ситуации.

***
Выполненные задания:

--SUGAR-BEGINNER

установить и настроить CRM (руссификация и настройка email)

установить ZuckerReports – не нужно

создать свой мродуль через констуктор модулей

кастомизировать форму редактирования записи, просмотра записи, списка

залить свой файл на сервер используя только загрузчик модулей

свой модуль связать с уже существующим, добавить субпанель в него

добавить свой javascript в форму редактирования записи

объединить вывод двух значений в одно поле (допустим создан кем и когда) в карточку контакта/*ФИО*/

объединить два значения в одно поле в списке, сабпанели (допустим имя и фамилию)

изменить содержимое всплывающей информации в ListView (Additional Details, иконка i в списке например, контакта или контрагента)

установить любую старую Sugar CRM и обновнить до последней актуальной, используя мастер обновления (https://sourceforge.net/projects/sugarcrm/
files/SugarCRM%20Release%20Archive/SugarCRM%206.5.X/)

--SUGAR-JUNIOR

повесить хук на сохранение записи – сохранение контрагента и своего модуля

добавить свою кнопку в субпанель (субпанель контактов в контрагентах)

добавить вычисляемое поле в карточку контрагента

добавить ссылку в правое верхнее меню

добавить свою задачу в планировщик

поменять иконки в "действиях" модуля

внедрить форму создания предварительного контакта на сторонний ресурс

высвечивать контакты с ДР другим цветом в listview и subpanel (BDATE==1)

добавить модуль в sugarfeed

добавить в карточку контакта iframe с любым ресурсом

*+action в модулях контрагентов/контактов, и пункты меню к ним

--SUGAR-SENIOR

добавить свой виджет (SugarWidgetSubPanelTopTestButton)

добавить кнопку в карточку контакта сверху (detailview) (допустим отправка письма этому контакту статичного содержания) - /modules/Contacts/StaticSender.php

добавить в администраторскую панель сохранение какой-либо переменной в sugarconfig system_test01

добавить в карточку контакта поле googlemap с точкой адреса если есть – даже сразу iframe с картой на этой точке

--SUGAR-MONSTER!!!

добавить свой чарт

соединится через SOAP или REST с SugarCRM, осуществить поиск по email

*добавить свой коннектор по примеру linked in (например facebook, vkontakte) – линкедин только в старой версии, в новых уже есть фб и твиттер, но требуют калбек на срм, чего не могу сейчас дать. А без примера работы фб вк не подключить.

добавить экшн в субпанель который экспортирует записи с человеческими именами (возможно кастомный запрос) - субпанель контактов в контрагентах

